In [ ]:
# DataFrame

In [2]:
import numpy as np
import pandas as pd

data = {
    "Name" : ["Alice", "Bob", "Charlie", "David", "Eva", "Frank"],
    "Age" : [24, 30, np.nan, 35, 28, 40],
    "Department" : ["HR", "Finance", "IT", "IT", "Finance", "HR"],
    "Salary" : [50000, 60000, 55000, 70000, np.nan, 80000]
}

data

# Converitng a dictionary to a DataFrame

df = pd.DataFrame(data)

print(f"\n Original DataFrame:\n{df}")

dataframe = df.copy() # Creating a copy of the original DataFrame

print(f"\n First 3 rows of the DataFrame: \n{df.head(3)}")
print(f"\n Last 2 rows of the DataFrame: \n{df.tail(2)}")

 Original DataFrame:
      Name   Age Department   Salary
0    Alice  24.0         HR  50000.0
1      Bob  30.0    Finance  60000.0
2  Charlie   NaN         IT  55000.0
3    David  35.0         IT  70000.0
4      Eva  28.0    Finance      NaN
5    Frank  40.0         HR  80000.0

 First 3 rows of the DataFrame:
      Name   Age Department   Salary
0    Alice  24.0         HR  50000.0
1      Bob  30.0    Finance  60000.0
2  Charlie   NaN         IT  55000.0

 Last 2 rows of the DataFrame:
    Name   Age Department   Salary
4    Eva  28.0    Finance      NaN
5  Frank  40.0         HR  80000.0

In [12]:
# Applying iloc method in DataFrame

print(f"\n Accessing specific rows using iloc : \n {df.iloc[1:3]}")
# It accesses rows at index 1 and 2 (excluding index 3)

# To access specific rows and columns we need to use loc method

# Accessing specific rows and columns using loc
print(f"\n Accessing specific rows and columns using loc : \n {df.loc[1:3,["Name","Age","Salary"]]}")

# Accessing columns using loc method
print(f"\n Accessing all rows with specific columns using loc : \n {df.loc[:,["Name","Department"]]}")

 Accessing specific rows using iloc :
       Name   Age Department   Salary
1      Bob  30.0    Finance  60000.0
2  Charlie   NaN         IT  55000.0

 Accessing specific rows and columns using loc :
       Name   Age   Salary
1      Bob  30.0  60000.0
2  Charlie   NaN  55000.0
3    David  35.0  70000.0

 Accessing all rows with specific columns using loc :
       Name Department
0    Alice         HR
1      Bob    Finance
2  Charlie         IT
3    David         IT
4      Eva    Finance
5    Frank         HR

In [15]:
# To get one column on DataFrame

df[['Age']]

    Age
0  24.0
1  30.0
2   NaN
3  35.0
4  28.0
5  40.0

In [11]:
# To get multiple columns on DataFrame

df[['Name','Salary']]

      Name   Salary
0    Alice  50000.0
1      Bob  60000.0
2  Charlie  55000.0
3    David  70000.0
4      Eva      NaN
5    Frank  80000.0

In [10]:
# To drop a column from DataFrame

df.drop('Department', axis = 1) # axis = 1 indicates that we are dropping a column

      Name   Age   Salary
0    Alice  24.0  50000.0
1      Bob  30.0  60000.0
2  Charlie   NaN  55000.0
3    David  35.0  70000.0
4      Eva  28.0      NaN
5    Frank  40.0  80000.0

In [9]:
# To drop a row from DataFrame

df.drop(2, axis = 0) # axis = 0 indicates that we are dropping a row

    Name   Age Department   Salary
0  Alice  24.0         HR  50000.0
1    Bob  30.0    Finance  60000.0
3  David  35.0         IT  70000.0
4    Eva  28.0    Finance      NaN
5  Frank  40.0         HR  80000.0

In [12]:
# # To drop both a column and a row from DataFrame

df.drop('Age',axis = 1).drop(3,axis = 0)
# Here first we are dropping the column 'Age' and then dropping the row with index 3

      Name Department   Salary
0    Alice         HR  50000.0
1      Bob    Finance  60000.0
2  Charlie         IT  55000.0
4      Eva    Finance      NaN
5    Frank         HR  80000.0

In [ ]:
# Original DataFrame prints

df

      Name   Age Department   Salary
0    Alice  24.0         HR  50000.0
1      Bob  30.0    Finance  60000.0
2  Charlie   NaN         IT  55000.0
3    David  35.0         IT  70000.0
4      Eva  28.0    Finance      NaN
5    Frank  40.0         HR  80000.0

In [16]:
df.drop(4,axis = 0, inplace = True)
# Here we are dropping the row with index 4 permanently from the original DataFrame
df

      Name   Age Department   Salary
0    Alice  24.0         HR  50000.0
1      Bob  30.0    Finance  60000.0
2  Charlie   NaN         IT  55000.0
3    David  35.0         IT  70000.0
5    Frank  40.0         HR  80000.0

In [17]:
df = dataframe.copy()  # Restoring the original DataFrame from the copy
df

      Name   Age Department   Salary
0    Alice  24.0         HR  50000.0
1      Bob  30.0    Finance  60000.0
2  Charlie   NaN         IT  55000.0
3    David  35.0         IT  70000.0
4      Eva  28.0    Finance      NaN
5    Frank  40.0         HR  80000.0

In [ ]:
# To check the shape of the DataFrame
df.shape

(6, 4)

In [20]:
# To check the information about the DataFrame
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        6 non-null      object
 1   Age         5 non-null      float64
 2   Department  6 non-null      object
 3   Salary      5 non-null      float64
dtypes: float64(2), object(2)
memory usage: 324.0+ bytes

In [21]:
# To describe the DataFrame
df.describe()

             Age        Salary
count   5.000000      5.000000
mean   31.400000  63000.000000
std     6.228965  12041.594579
min    24.000000  50000.000000
25%    28.000000  55000.000000
50%    30.000000  60000.000000
75%    35.000000  70000.000000
max    40.000000  80000.000000